{

  "init_device": "meta",
  "init_fn": "mitchell",
  "init_std": 0.02,

  "activation_type": "silu",
  "alibi": false,
  "alibi_bias_max": 8.0,

  "architectures": ["LLaDAModelLM"],
  "auto_map": {
    "AutoConfig": "configs_llada.LLaDAConfig",
    "AutoModelForCausalLM": "model.LLaDAModelLM",
    "AutoModel": "model.LLaDAModelLM"
  },

  "d_model": 768,
  "n_layers": 14,
  "n_heads": 12,
  "n_kv_heads": 12,
  "mlp_ratio": 4,
  "mlp_hidden_size": 3072,        
  "max_sequence_length": 4096,


  "vocab_size": 126464,
  "mask_token_id": 126336,
  "eos_token_id": 126081,
  "pad_token_id": 126081,

  "layer_norm_type": "rms",
  "rms_norm_eps": 1e-5,
  "attention_dropout": 0.0,
  "residual_dropout": 0.0,
  "embedding_dropout": 0.0,


  "block_type": "llama",
  "block_group_size": 1,
  "attention_layer_norm": false,
  "attention_layer_norm_with_affine": true,
  "rope": true,
  "rope_full_precision": true,
  "rope_theta": 500000.0,


  "precision": "bf16",              
  "use_cache": false,
  "weight_tying": false,

  "model_type": "llada",
  "transformers_version": "4.53.1"
}
